{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "326f1c57",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "import pandas as pd\n",
    "from py2neo import Graph, Node, Relationship\n",
    "import json\n",
    "import os\n",
    "import csv\n",
    "import collections\n",
    "import re\n",
    "from jsonpath_ng.ext import parse\n",
    "import ssl\n",
    "import networkx as nx\n",
    "import concurrent.futures\n",
    "import time"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "b155240a",
   "metadata": {},
   "outputs": [],
   "source": [
    "from gqlalchemy import Memgraph\n",
    "memgraph = Memgraph(\"localhost\", 7687)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 70,
   "id": "fe392be7",
   "metadata": {},
   "outputs": [],
   "source": [
    "graph = Graph(\"http://localhost:7474\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "0fb5d858",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "skipping\n",
      "skipping\n",
      "skipping\n",
      "skipping\n",
      "skipping\n"
     ]
    }
   ],
   "source": [
    "directory_path = \"ali_nicholas_EuSNbSe2_gemd_model_dumps\"\n",
    "json_data = []\n",
    "for filename in os.listdir(directory_path):\n",
    "    file_path = os.path.join(directory_path, filename)\n",
    "    try:\n",
    "        with open(file_path, encoding='utf-8') as file:\n",
    "            json_data.append(json.load(file))\n",
    "    except:\n",
    "        print(\"skipping\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "4e771d33",
   "metadata": {},
   "source": [
    "# Graph Traits #"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "a5b2c44e",
   "metadata": {},
   "outputs": [],
   "source": [
    "def create_pairs():\n",
    "    ingredient_spec_expr = parse('$[?(@.type == \"ingredient_spec\")]')\n",
    "    nodes = ingredient_spec_expr.find(json_data)\n",
    "    materialSpec_to_ingredientSpec = collections.defaultdict(list)\n",
    "    for n in nodes:\n",
    "        ingredient_id = n.value['uids']['auto']\n",
    "        material_id = n.value['material']['id']\n",
    "        materialSpec_to_ingredientSpec[material_id].append(ingredient_id)\n",
    "    ingredient_spec_expr = parse('$[?(@.type == \"ingredient_spec\")]')\n",
    "    nodes = ingredient_spec_expr.find(json_data)\n",
    "    processSpec_to_ingredientSpec = collections.defaultdict(list)\n",
    "    for n in nodes:\n",
    "        ingredient_id = n.value['uids']['auto']\n",
    "        process_id = n.value['process']['id']\n",
    "        processSpec_to_ingredientSpec[process_id].append(ingredient_id)\n",
    "    ingredient_run_expr = parse('$[?(@.type == \"ingredient_run\")]')\n",
    "    nodes = ingredient_run_expr.find(json_data)\n",
    "    processRun_to_ingredientRun = collections.defaultdict(list)\n",
    "    for n in nodes:\n",
    "        ingredient_id = n.value['uids']['auto']\n",
    "        process_id = n.value['process']['id']\n",
    "        processRun_to_ingredientRun[process_id].append(ingredient_id)\n",
    "    measurement_run_expr = parse('$[?(@.type == \"measurement_run\")]')\n",
    "    nodes = measurement_run_expr.find(json_data)\n",
    "    materialRun_to_measurementRun = collections.defaultdict(list)\n",
    "    for n in nodes:\n",
    "        measurement_id = n.value['uids']['auto']\n",
    "        material_id = n.value['material']['id']\n",
    "        materialRun_to_measurementRun[material_id].append(measurement_id)\n",
    "    return materialSpec_to_ingredientSpec, processSpec_to_ingredientSpec, processRun_to_ingredientRun, \\\n",
    "           materialRun_to_measurementRun"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "457ad1ef",
   "metadata": {},
   "outputs": [],
   "source": [
    "materialSpec_to_ingredientSpec, processSpec_to_ingredientSpec, processRun_to_ingredientRun, \\\n",
    "materialRun_to_measurementRun = create_pairs()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "97536cbd",
   "metadata": {},
   "source": [
    "## On original graph ##"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "56333981",
   "metadata": {},
   "source": [
    "Assumptions:\n",
    "1. spec nodes and its corresponding run nodes will point towards the same parameter_template and condition_template nodes"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 66,
   "id": "c8d6b473",
   "metadata": {},
   "outputs": [],
   "source": [
    "# 1. Find all triangles in the graph, and count the number of triangles that each edge participates in.\n",
    "# 2. Repeatedly find a vertex v that is an endpoint of an edge participating in a number of triangles equal \n",
    "#    to the degree of v minus one, delete v, and decrement the triangles per edge of each remaining edge that \n",
    "#   formed a triangle with v. \n",
    "def isCopWin():\n",
    "    Id_to_cnt = getTriangles()\n",
    "    removeId = findDominant(Id_to_cnt)\n",
    "    while removeId:\n",
    "        print(removeId)\n",
    "        Id_to_cnt = removeDominant(removeId, Id_to_cnt)\n",
    "        removeId = findDominant(Id_to_cnt)\n",
    "    query = \"\"\"\n",
    "            MATCH (n)\n",
    "            RETURN count(distinct n.node_id) as remaining_cnt\n",
    "            \"\"\"\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        if record['remaining_cnt'] == 1:\n",
    "            return True\n",
    "    return False\n",
    "                \n",
    "        \n",
    "    \n",
    "# find the number of triangles that each edge participated in\n",
    "def getTriangles():\n",
    "    Id_to_cnt = {}\n",
    "    query = \"\"\"\n",
    "            MATCH path = (n)-[e1]-(m)-[e2]-(p)-[e3]-(n)\n",
    "            WHERE ID(e1) < ID(e2) AND ID(e2) < ID(e3) AND ID(e1) < ID(e3)\n",
    "            RETURN n.node_id as nid, m.node_id as mid, count(path) as pathCount\n",
    "            \"\"\"\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        nid = record['nid']\n",
    "        mid = record['mid']\n",
    "        pathCount = record['pathCount']\n",
    "        if (nid, mid) in Id_to_cnt:\n",
    "            print('edge already visited')\n",
    "        else:\n",
    "            Id_to_cnt[(nid, mid)] = pathCount\n",
    "    query = \"\"\"\n",
    "            MATCH path = (n)-[e1]-(m)-[e2]-(p)-[e3]-(n)\n",
    "            WHERE ID(e1) < ID(e2) AND ID(e2) < ID(e3) AND ID(e1) < ID(e3)\n",
    "            RETURN m.node_id as mid, p.node_id as pid, count(path) as pathCount\n",
    "            \"\"\"\n",
    "    for record in result:\n",
    "        mid  = record['mid']\n",
    "        pid = record['pid']\n",
    "        pathCount = record['pathCount']\n",
    "        if (mid, pid) in Id_to_cnt:\n",
    "            print('edge already visited')\n",
    "        else:\n",
    "            Id_to_cnt[(mid, pid)] = pathCount\n",
    "    query = \"\"\"\n",
    "            MATCH path = (n)-[e1]-(m)-[e2]-(p)-[e3]-(n)\n",
    "            WHERE ID(e1) < ID(e2) AND ID(e2) < ID(e3) AND ID(e1) < ID(e3)\n",
    "            RETURN p.node_id as pid, n.node_id as nid, count(path) as pathCount\n",
    "            \"\"\"\n",
    "    for record in result:\n",
    "        pid = record['pid']\n",
    "        nid = record['nid']\n",
    "        pathCount = record['pathCount']\n",
    "        if (pid, nid) in Id_to_cnt:\n",
    "            print('edge already visited')\n",
    "        else:\n",
    "            Id_to_cnt[(pid, nid)] = pathCount\n",
    "    return Id_to_cnt\n",
    "\n",
    "def findDominant(Id_to_cnt):\n",
    "    node_to_cnt = {}\n",
    "    for (id1, id2), val in Id_to_cnt.items():\n",
    "        if val == 0:\n",
    "            continue\n",
    "        if id1 not in node_to_cnt:\n",
    "            node_to_cnt[id1] = val\n",
    "        else:\n",
    "            node_to_cnt[id1] += val\n",
    "        if id2 not in node_to_cnt:\n",
    "            node_to_cnt[id2] = val\n",
    "        else:\n",
    "            node_to_cnt[id2] += val\n",
    "    print(node_to_cnt)\n",
    "    for node_id, cnt in node_to_cnt.items():\n",
    "        query = \"\"\"\n",
    "                MATCH (n)-[r]-(m)\n",
    "                WHERE n.node_id = '{}'\n",
    "                RETURN COUNT(distinct m.node_id) as count\n",
    "                \"\"\".format(node_id)\n",
    "        result = graph.run(query)\n",
    "        for record in result:\n",
    "            if cnt == record['count']-1:\n",
    "                return node_id\n",
    "    return None\n",
    "\n",
    "def removeDominant(node_id, Id_to_cnt):\n",
    "    query = '''\n",
    "            MATCH (n)-[r]-(m)\n",
    "            WHERE n.node_id = '{}'\n",
    "            RETURN distinct m.node_id as mid\n",
    "            '''.format(node_id)\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        mid = record['mid']\n",
    "        if (node_id, mid) in Id_to_cnt:\n",
    "            Id_to_cnt[(node_id, mid)] -= 1\n",
    "        if (mid, node_id) in Id_to_cnt:\n",
    "            Id_to_cnt[(mid, node_id)] -= 1\n",
    "    query = '''\n",
    "            MATCH (n)\n",
    "            WHERE n.node_id = '{}'\n",
    "            DETACH DELETE n\n",
    "            '''.format(node_id)\n",
    "    graph.run(query)\n",
    "    return Id_to_cnt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "107018a7",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 36, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 56, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 4, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 4, '51145cb9-3635-43f0-b441-cb06dcd94bad': 4, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 6, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 4, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "08884a4a-8e00-4861-8ca4-f8f001c6a5ea\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 35, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 55, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 4, '51145cb9-3635-43f0-b441-cb06dcd94bad': 4, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 6, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 4, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "cb813f67-1503-4e2a-a761-5cb0967ba1f2\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 34, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 54, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 4, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 6, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 4, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "51145cb9-3635-43f0-b441-cb06dcd94bad\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 33, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 53, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 6, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 4, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "ddbd0dc6-c594-478c-b56a-c735693abfcb\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 32, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 52, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 4, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "f4f151a5-93b8-4012-8fca-4396006fea9f\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 31, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 51, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 6, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "f3ddea55-a248-4bc9-9b15-6791d49b6d90\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 30, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 50, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 6, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "e01f395b-2e4e-4fed-8c60-effbb19dfca9\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 29, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 49, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 4, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "5e3a322c-70e4-4024-888b-3a92fce47449\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 28, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 48, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 4, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "3242cbb2-fb6d-4246-80f6-8b1fef94b934\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 27, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 47, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 4, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "b055b900-25b6-4510-a294-ea0e6bb374b7\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 26, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 46, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 2, '84ad56b5-6d9d-4644-8366-55592f1cb507': 4, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "84ad56b5-6d9d-4644-8366-55592f1cb507\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 25, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 45, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 2, '84ad56b5-6d9d-4644-8366-55592f1cb507': 2, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 4, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "47ba4e29-2ac8-493f-818d-21f9acac74ed\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 24, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 44, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 2, '84ad56b5-6d9d-4644-8366-55592f1cb507': 2, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 2, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 4, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 6, 'categorical_bounds 6': 8, 'categorical_bounds 28': 27, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n",
      "b5cfe014-740b-44dd-b571-dc4e07b002d7\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 24, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 44, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 2, '84ad56b5-6d9d-4644-8366-55592f1cb507': 2, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 2, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 3, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 3, 'categorical_bounds 6': 7, 'categorical_bounds 28': 26, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 6, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1b677cc3-b46e-4dab-8fa8-64f9473e9523\n",
      "{'aeb8081b-d8a4-47e5-9fd6-fd5e9bdcb5a1': 21, 'a9846ca7-3414-4da7-acf7-656a596099ce': 8, '0471f9aa-d24d-4598-ac94-02c6dd1c8d1d': 24, '00de68f0-57d8-42fc-b5f4-4a1f21d7dc68': 21, '431e116c-dbcf-4927-9100-7e175cdf0342': 44, '08884a4a-8e00-4861-8ca4-f8f001c6a5ea': 2, 'cb813f67-1503-4e2a-a761-5cb0967ba1f2': 2, '51145cb9-3635-43f0-b441-cb06dcd94bad': 2, 'ddbd0dc6-c594-478c-b56a-c735693abfcb': 4, 'f4f151a5-93b8-4012-8fca-4396006fea9f': 2, 'c837c92a-cbd0-4e6f-b976-9ffe1682ffdb': 17, '3e90dbf4-7ec9-42b6-b558-31d44a0c90ee': 15, '85546fe9-ce12-41fd-9c4f-b2d4a2b21986': 13, 'f3ddea55-a248-4bc9-9b15-6791d49b6d90': 4, 'e01f395b-2e4e-4fed-8c60-effbb19dfca9': 4, '5e3a322c-70e4-4024-888b-3a92fce47449': 2, 'b0348186-4b68-4c09-bbbb-120cea1e8465': 8, '93caf0ed-04cf-45f7-a434-e36db463d36c': 15, '4b64c5aa-9cdb-4fdc-8b71-065c0c72ab6f': 8, '17701233-7557-4ca3-bc6c-295b7fe6bbc2': 8, '3242cbb2-fb6d-4246-80f6-8b1fef94b934': 2, '4767698c-c078-40b3-bef1-cd43c67d52a3': 2, '0db4a2d7-ee84-40de-891f-c18f8712e650': 15, '85f14511-68df-46ac-a612-23b5fa6ec25d': 2, '8e9d9c87-e8d4-4926-94ea-37a7944278be': 5, '3322faa3-b37a-4149-888b-f429566b3f32': 15, 'f5582503-17b5-4092-89df-f284a0cf5f35': 2, '9aec6466-52ea-4d32-a45a-f7ff123d1c06': 3, 'b055b900-25b6-4510-a294-ea0e6bb374b7': 2, '84ad56b5-6d9d-4644-8366-55592f1cb507': 2, 'c4640916-32a7-46f5-9581-4ef25c5e50e9': 2, '47ba4e29-2ac8-493f-818d-21f9acac74ed': 2, '81046d91-0e99-4d9e-8ab0-422d5f772d28': 2, 'categorical_bounds 7': 2, 'b5cfe014-740b-44dd-b571-dc4e07b002d7': 3, 'categorical_bounds 6': 6, 'categorical_bounds 28': 25, 'categorical_bounds 3': 13, '0d6a8cee-9095-4323-b611-e089d4eccfc3': 4, 'categorical_bounds 27': 22, '08ca83ca-a4f1-4125-afa2-3cab34b8e0f9': 6, 'categorical_bounds 30': 6, '43d9e08e-c4a0-4951-adfc-06c7cc42fb4a': 3, 'b899190d-8e2e-4273-8bee-ec0788ef847c': 2, 'categorical_bounds 4': 4, '1eecf772-cafd-4bee-926c-d725b74901df': 8, 'categorical_bounds 9': 4, 'categorical_bounds 29': 4, '3ad6f87d-862f-47e3-87dd-4d9e2a52eeb1': 6, '1b677cc3-b46e-4dab-8fa8-64f9473e9523': 3, '1603c6be-221e-4708-9b61-6bc15b456be8': 6, '280044ac-120e-4fd0-bf33-039dc199ae98': 6, '3fdb9ec8-586e-471d-bd53-7c603d58dd5a': 6, 'categorical_bounds 31': 4, 'categorical_bounds 10': 4, 'aeb4b7b9-2d67-4a4c-a504-b85f9a673144': 8, 'categorical_bounds 11': 4, 'categorical_bounds 5': 4, '065f2f3a-7b2b-4eb5-aa29-3f9cdd5bb631': 4, 'a8d66ef9-6aeb-4600-b70f-d0230da9475d': 4, 'categorical_bounds 32': 4, 'b9237790-4823-4072-8b34-2e0bf1e24455': 6, '003cf75f-d6f2-44fb-ad4e-f6d255b54e92': 8, 'c52ecbbd-f97f-4ff8-8b5a-ad9e17ec7055': 8, 'e095c54b-90fd-4e26-9b80-cbf38a2adcc0': 2, 'e235f9eb-1cbb-4431-be8d-c6498764949a': 4, '0902477f-1adf-49f6-9af7-aef1ff905d38': 4, '2c9da579-7263-4832-a000-14110d734b24': 2, 'ab33e68b-475f-4dc2-b96b-5fc3d373cdd7': 1, '9fe40704-b969-40a4-8f82-98832bce5b02': 1, '0afb2915-d60c-4087-a7d6-5d023f4379b7': 1}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "isCopWin()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b1ca40f3",
   "metadata": {},
   "source": [
    "## On modified graph (without parameter/condition/property templates & categorical_bounds ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 49,
   "id": "9e01d657",
   "metadata": {},
   "outputs": [],
   "source": [
    "def removeTemplates(materialSpec_to_ingredientSpec):\n",
    "    query = '''\n",
    "            MATCH (n)\n",
    "            WHERE n.type = 'property_template' OR n.type = 'parameter_template' OR n.type = 'condition_template' OR \n",
    "                  n.type = 'categorical_bounds'\n",
    "            DETACH DELETE n\n",
    "            '''\n",
    "    graph.run(query)\n",
    "    for material_id, ingredient_ids in materialSpec_to_ingredientSpec.items():\n",
    "        for ingredient_id in ingredient_ids:\n",
    "            query = '''\n",
    "                    MATCH (n1:material_spec), (n2:ingredient_spec)\n",
    "                    WHERE n1.node_id = '{}' AND n2.node_id = '{}'\n",
    "                    CREATE (n1)-[:materialSpec_to_ingredientSpec]->(n2)\n",
    "                    '''.format(material_id, ingredient_id)\n",
    "            graph.run(query)\n",
    "    for process_id, ingredient_ids in processSpec_to_ingredientSpec.items():\n",
    "        for ingredient_id in ingredient_ids:\n",
    "            query = '''\n",
    "                    MATCH (n1:ingredient_spec), (n2:process_spec)\n",
    "                    WHERE n1.node_id = '{}' AND n2.node_id = '{}'\n",
    "                    CREATE (n1)-[:ingredientSpec_to_processSpec]->(n2)\n",
    "                    '''.format(ingredient_id, process_id)\n",
    "            graph.run(query)\n",
    "    for process_id, ingredient_ids in processRun_to_ingredientRun.items():\n",
    "        for ingredient_id in ingredient_ids:\n",
    "            query = '''\n",
    "                    MATCH (n1:ingredient_run), (n2:process_run)\n",
    "                    WHERE n1.node_id = '{}' AND n2.node_id = '{}'\n",
    "                    CREATE (n1)-[:ingredientRun_to_processRun]->(n2)\n",
    "                    '''.format(ingredient_id, process_id)\n",
    "            graph.run(query)\n",
    "    for material_id, measurement_ids in materialRun_to_measurementRun.items():\n",
    "        for measurement_id in measurement_ids:\n",
    "            query = '''\n",
    "                    MATCH (n1:measurement_run), (n2:material_run)\n",
    "                    WHERE n1.node_id = '{}' AND n2.node_id = '{}'\n",
    "                    CREATE (n1)-[:measurementRun_to_materialRun]->(n2)\n",
    "                    '''.format(measurement_id, material_id)\n",
    "            graph.run(query)\n",
    "    \n",
    "    query = '''\n",
    "        MATCH (source)-[r]->(target)\n",
    "        WITH source, target, COLLECT(r) AS relationshipList, COUNT(r) AS count\n",
    "        WHERE count > 1\n",
    "        CALL apoc.refactor.mergeRelationships(relationshipList) YIELD rel\n",
    "        RETURN source,target\n",
    "    '''\n",
    "    graph.run(query)\n",
    "    return"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "id": "88c73ae1",
   "metadata": {},
   "outputs": [],
   "source": [
    "removeTemplates(materialSpec_to_ingredientSpec)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "4a168793",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{}\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 57,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "isCopWin()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "d9eeec49",
   "metadata": {},
   "source": [
    "# Decoupling #"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "125c6207",
   "metadata": {},
   "outputs": [],
   "source": [
    "ingredientSpec_to_materialSpec = {}\n",
    "for key, value in materialSpec_to_ingredientSpec.items():\n",
    "    for v in value:\n",
    "        ingredientSpec_to_materialSpec[v] = key"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "391b64ac",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_nodes(nodes):\n",
    "    for node in nodes:\n",
    "        node_id = ''\n",
    "        name = ''\n",
    "        notes = ''\n",
    "        real_lower_bound = ''\n",
    "        real_upper_bound = ''\n",
    "        real_units = ''\n",
    "        real_name_sub = ''\n",
    "        real_value_sub = ''\n",
    "        real_units_sub = ''\n",
    "        description = ''\n",
    "        node_type = ''\n",
    "        tags = ''\n",
    "        sample_type = ''\n",
    "        mass_fraction = ''\n",
    "        number_fraction = ''\n",
    "        volume_fraction = ''\n",
    "        source_performed_by = ''\n",
    "        source_performed_date = ''\n",
    "        source_type = ''\n",
    "        absolute_quantity_lower_bound = ''\n",
    "        absolute_quantity_type = ''\n",
    "        absolute_quantity_units = ''\n",
    "        absolute_quantity_upper_bound = ''\n",
    "        absolute_nominal = ''\n",
    "        allowed_labels = ''\n",
    "        allowed_names = ''\n",
    "        file_links = ''\n",
    "        isCopy = ''\n",
    "        copyId = ''\n",
    "        if 'node_id' in node:\n",
    "            node_id = node['node_id']\n",
    "        if 'name' in node:\n",
    "            name = node['name']\n",
    "        if 'notes' in node:\n",
    "            notes = node['notes']\n",
    "        if 'real_lower_bound' in node:\n",
    "            real_lower_bound = node['real_lower_bound']\n",
    "        if 'real_upper_bound' in node:\n",
    "            real_upper_bound = node['real_upper_bound']\n",
    "        if 'real_units' in node:\n",
    "            real_units = node['real_units']\n",
    "        if 'real_name_sub' in node:\n",
    "            real_name_sub = node['real_name_sub']\n",
    "        if 'real_value_sub' in node:\n",
    "            real_value_sub = node['real_value_sub']\n",
    "        if 'real_units_sub' in node:\n",
    "            real_units_sub = node['real_units_sub']\n",
    "        if 'description' in node:\n",
    "            description = node['description']\n",
    "        if 'type' in node:\n",
    "            node_type = node['type']\n",
    "        if 'tags' in node:\n",
    "            tags = node['tags']\n",
    "        if 'sample_type' in node:\n",
    "            sample_type = node['sample_type']\n",
    "        if 'mass_fraction' in node:\n",
    "            mass_fraction = node['mass_fraction']\n",
    "        if 'number_fraction' in node:\n",
    "            number_fraction = node['number_fraction']\n",
    "        if 'volume_fraction' in node:\n",
    "            volume_fraction = node['volume_fraction']\n",
    "        if 'source_performed_by' in node:\n",
    "            source_performed_by = node['source_performed_by']\n",
    "        if 'source_performed_date' in node:\n",
    "            source_performed_date = node['source_performed_date']\n",
    "        if 'source_type' in node:\n",
    "            source_type = node['source_type']\n",
    "        if 'absolute_quantity_lower_bound' in node:\n",
    "            absolute_quantity_lower_bound = node['absolute_quantity_lower_bound']\n",
    "        if 'absolute_quantity_type' in node:\n",
    "            absolute_quantity_type = node['absolute_quantity_type']\n",
    "        if 'absolute_quantity_units' in node:\n",
    "            absolute_quantity_units = node['absolute_quantity_units']\n",
    "        if 'absolute_quantity_upper_bound' in node:\n",
    "            absolute_quantity_upper_bound = node['absolute_quantity_upper_bound']\n",
    "        if 'absolute_nominal' in node:\n",
    "            absolute_nominal = node['absolute_nominal']\n",
    "        if 'allowed_labels' in node:\n",
    "            allowed_labels = node['allowed_labels']\n",
    "        if 'allowed_names' in node:\n",
    "            allowed_names = node['allowed_names']\n",
    "        if 'file_links' in node:\n",
    "            file_links = node['file_links']\n",
    "        if 'isCopy' in node:\n",
    "            isCopy = node['isCopy']\n",
    "        query = \"\"\"\n",
    "                CREATE (:{} {{node_id: \"{}\", name: \"{}\", notes: \"{}\", real_lower_bound: \"{}\",\n",
    "                              real_upper_bound: \"{}\", real_units: \"{}\", real_name_sub: \"{}\",\n",
    "                              real_value_sub: \"{}\", real_units_sub: \"{}\", description: \"{}\",\n",
    "                              type: \"{}\", tags: \"{}\", sample_type: \"{}\", mass_fraction: \"{}\",\n",
    "                              number_fraction: \"{}\", volume_fraction: \"{}\", source_performed_by: \"{}\",\n",
    "                              source_performed_date: \"{}\", source_type: \"{}\", absolute_quantity_lower_bound: \"{}\",\n",
    "                              absolute_quantity_type: \"{}\", absolute_quantity_units: \"{}\", \n",
    "                              absolute_quantity_upper_bound: \"{}\", absolute_nominal: \"{}\",\n",
    "                              allowed_labels: \"{}\", allowed_names: \"{}\", file_links: \"{}\", isCopy: \"{}\"}});\n",
    "                \"\"\".format(node_type, node_id, name, notes, real_lower_bound, real_upper_bound, real_units, real_name_sub,\\\n",
    "                           real_value_sub, real_units_sub, description, node_type, tags, sample_type, mass_fraction,\\\n",
    "                           number_fraction, volume_fraction, source_performed_by, source_performed_date, source_type,\\\n",
    "                           absolute_quantity_lower_bound, absolute_quantity_type, absolute_quantity_units, \\\n",
    "                           absolute_quantity_upper_bound, absolute_nominal, allowed_labels, allowed_names, file_links,\\\n",
    "                           isCopy)\n",
    "        memgraph.execute(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "d7dd0786",
   "metadata": {},
   "outputs": [],
   "source": [
    "def add_edges(edges):\n",
    "    for [source, target,label] in edges:\n",
    "        query = \"\"\"\n",
    "                MATCH (a), (b)\n",
    "                WHERE a.node_id =~ '{}.*' AND b.node_id =~ '{}.*'\n",
    "                CREATE (a)-[:{}]->(b);\n",
    "                \"\"\".format(source, target, label)\n",
    "        memgraph.execute(query)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "9e0af002",
   "metadata": {},
   "outputs": [],
   "source": [
    "def template_category_copy(node_id, node_type, node_set, edge_set):\n",
    "    original_node_id = node_id.split(',')[0]\n",
    "    start_node_ids = []\n",
    "    res = []\n",
    "    nodes = []\n",
    "    edges = []\n",
    "    if node_type == 'material_run':\n",
    "        start_node_ids = materialRun_to_measurementRun[original_node_id]\n",
    "    elif node_type == 'process_run':\n",
    "        start_node_ids = processRun_to_ingredientRun[original_node_id]\n",
    "    for start_node_id in start_node_ids:\n",
    "        query = '''\n",
    "                MATCH (n1)-[r1]->(n2)-[r2]->(n3)-[r3]->(n4)\n",
    "                WHERE n1.node_id = \"{}\" AND n4.node_id = \"{}\"\n",
    "                RETURN apoc.convert.toJson(apoc.convert.toMap(n1)) AS n1,\n",
    "                       apoc.convert.toJson(apoc.convert.toMap(n2)) AS n2,\n",
    "                       apoc.convert.toJson(apoc.convert.toMap(n3)) AS n3\n",
    "                '''.format(start_node_id, original_node_id)\n",
    "        result = graph.run(query)\n",
    "        for record in result:\n",
    "            for i in range(len(record)//3):\n",
    "                n1 = json.loads(record[3*i])\n",
    "                n2 = json.loads(record[3*i+1])\n",
    "                n3 = json.loads(record[3*i+2])\n",
    "                n2['node_id'] = n2['node_id'] + ',' + start_node_id + ',' + node_id\n",
    "                n3['node_id'] = n3['node_id'] + ',' + start_node_id + ',' + node_id\n",
    "                n1['node_id'] = n1['node_id'] + ',' + node_id\n",
    "                if n1['node_id'] not in node_set:\n",
    "                    res.append((n1['node_id'], n1['type']))\n",
    "                    node_set.add(n1['node_id'])\n",
    "                    nodes.append(n1)\n",
    "                if n2['node_id'] not in node_set:\n",
    "                    node_set.add(n2['node_id'])\n",
    "                    nodes.append(n2)\n",
    "                if n3['node_id'] not in node_set:\n",
    "                    node_set.add(n3['node_id'])\n",
    "                    nodes.append(n3)\n",
    "                if (n1['node_id'], n2['node_id']) not in edge_set:\n",
    "                    edge_set.add((n1['node_id'], n2['node_id']))\n",
    "                    edges.append([n1['node_id'], n2['node_id'], n1['type']+'_to_'+n2['type']])\n",
    "                if (n2['node_id'], n3['node_id']) not in edge_set:\n",
    "                    edge_set.add((n2['node_id'], n3['node_id']))\n",
    "                    edges.append([n2['node_id'], n3['node_id'], n2['type']+'_to_'+n3['type']])\n",
    "                if (n3['node_id'], node_id) not in edge_set:\n",
    "                    edge_set.add((n3['node_id'], node_id))\n",
    "                    edges.append([n3['node_id'], node_id, n3['type']+'_to_'+node_type])\n",
    "    add_nodes(nodes)\n",
    "    add_edges(edges)\n",
    "    return res\n",
    "            \n",
    "def isShared(node_id):\n",
    "    query = '''\n",
    "            MATCH (n)-[r]->(m)\n",
    "            WHERE n.node_id = \"{}\"\n",
    "            RETURN m.type as type, count(distinct m.node_id) as count\n",
    "            '''.format(node_id)\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        if record['count'] > 1:\n",
    "            return True\n",
    "    query = '''\n",
    "            MATCH (n)-[r]->(m)\n",
    "            WHERE n.node_id = \"{}\"\n",
    "            RETURN distinct m.node_id as mid\n",
    "            '''.format(node_id)\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        mid = record['mid']\n",
    "        query = '''\n",
    "                MATCH (n)\n",
    "                WHERE n.node_id =~ '{}.*'\n",
    "                RETURN count(distinct n.node_id) as count\n",
    "                '''.format(mid)\n",
    "        res = memgraph.execute_and_fetch(query)\n",
    "        for r in res:\n",
    "            if r['count'] > 1:\n",
    "                return True\n",
    "    return False\n",
    "\n",
    "def BFS():\n",
    "    memgraph.execute('MATCH (n) DETACH DELETE n')\n",
    "    q = collections.deque()\n",
    "    node_set = set()\n",
    "    edge_set = set()\n",
    "    nodes = []\n",
    "    query = \"\"\"\n",
    "            MATCH (n:material_run)\n",
    "            WHERE NOT EXISTS ((n)-[]->())\n",
    "            RETURN apoc.convert.toJson(apoc.convert.toMap(n)) AS n\n",
    "            \"\"\"\n",
    "    result = graph.run(query)\n",
    "    for record in result:\n",
    "        n = json.loads(record['n'])\n",
    "        if n['node_id'] not in node_set:\n",
    "            nodes.append(n)\n",
    "            node_set.add(n['node_id'])\n",
    "            q.append((n['node_id'], n['type']))\n",
    "    add_nodes(nodes)\n",
    "\n",
    "    while q:\n",
    "        node_id, node_type = q.popleft()\n",
    "        original_node_id = node_id.split(',')[0]\n",
    "        query = '''\n",
    "                MATCH (n)-[r]->(m)\n",
    "                WHERE m.node_id = \"{}\"\n",
    "                RETURN apoc.convert.toJson(apoc.convert.toMap(n)) AS n\n",
    "                '''.format(original_node_id)\n",
    "        result = graph.run(query)\n",
    "        add_category = False\n",
    "        for record in result:\n",
    "            n = json.loads(record['n'])\n",
    "            if n['type'] == 'categorical_bounds':\n",
    "                res = template_category_copy(node_id, node_type, node_set, edge_set)\n",
    "                for (r_id, r_type) in res:\n",
    "                    q.append((r_id, r_type))\n",
    "                continue\n",
    "            if 'spec' in n['type'] and 'spec' in node_type:\n",
    "                continue\n",
    "            if n['type'] == 'categorical_bounds' and 'spec' in node_type:\n",
    "                continue\n",
    "            if not isShared(n['node_id']):\n",
    "                if n['node_id'] not in node_set:\n",
    "                    q.append((n['node_id'], n['type']))\n",
    "                    node_set.add(n['node_id'])\n",
    "                    add_nodes([n])\n",
    "                if (n['node_id'], node_id) not in edge_set:\n",
    "                    edge_set.add((n['node_id'], node_id))\n",
    "                    add_edges([[n['node_id'], node_id, n['type']+'_to_'+node_type]])\n",
    "            else:\n",
    "                copyN = n\n",
    "                copyN['node_id'] = copyN['node_id'] + ',' + node_id\n",
    "                if copyN['node_id'] not in node_set:\n",
    "                    q.append((copyN['node_id'], copyN['type']))\n",
    "                    node_set.add(copyN['node_id'])\n",
    "                    add_nodes([copyN])\n",
    "                if (copyN['node_id'], node_id) not in edge_set:\n",
    "                    edge_set.add((copyN['node_id'], node_id))\n",
    "                    add_edges([[copyN['node_id'], node_id, copyN['type']+'_to_'+node_type]])\n",
    "                    \n",
    "def add_processSpec_to_materialSpec():\n",
    "    query = '''\n",
    "        MATCH (n1:process_spec)-[r1]->(n2:process_run)-[r2]->(n3:material_run)<-[r3]-(n4:material_spec)\n",
    "        CREATE (n1)-[:process_spec_to_material_spec]->(n4)\n",
    "        '''\n",
    "    memgraph.execute(query)\n",
    "\n",
    "def add_materialSpec_to_ingredientSpec():\n",
    "    query = '''\n",
    "        MATCH (n1:material_spec)-[r1]->(n2:material_run)-[r2]->(n3:ingredient_run)<-[r3]-(n4:ingredient_spec)\n",
    "        RETURN n1.node_id as n1_id, n4.node_id as n4_id\n",
    "        '''\n",
    "    result = memgraph.execute_and_fetch(query)\n",
    "    nodes = []\n",
    "    node_set = set()\n",
    "    edges = []\n",
    "    edge_set = set()\n",
    "    for record in result:\n",
    "        n1_id = record['n1_id']\n",
    "        n4_id = record['n4_id']\n",
    "        original_n1_id = n1_id.split(',')[0]\n",
    "        original_n4_id = n4_id.split(',')[0]\n",
    "        query = '''\n",
    "                MATCH (n1:material_spec)-[r1]->(n2:property_template)-[r2]->(n3:categorical_bounds)-\n",
    "                      [r3]->(n4:ingredient_spec)\n",
    "                WHERE n1.node_id = \"{}\" AND n4.node_id = \"{}\"\n",
    "                RETURN apoc.convert.toJson(apoc.convert.toMap(n2)) AS n2, \n",
    "                       apoc.convert.toJson(apoc.convert.toMap(n3)) AS n3\n",
    "                '''.format(original_n1_id, original_n4_id)\n",
    "        res = graph.run(query)\n",
    "        for rec in res:\n",
    "            for i in range(len(rec)//2):\n",
    "                n2 = json.loads(rec[2*i])\n",
    "                n3 = json.loads(rec[2*i+1])\n",
    "                n2['node_id'] = n2['node_id'] + ',' + n1_id + ',' + n4_id\n",
    "                n3['node_id'] = n3['node_id'] + ',' + n1_id + ',' + n4_id\n",
    "                if n2['node_id'] not in node_set:\n",
    "                    node_set.add(n2['node_id'])\n",
    "                    nodes.append(n2)\n",
    "                if n3['node_id'] not in node_set:\n",
    "                    node_set.add(n3['node_id'])\n",
    "                    nodes.append(n3)\n",
    "                if (n1_id, n2['node_id']) not in edge_set:\n",
    "                    edge_set.add((n1_id, n2['node_id']))\n",
    "                    edges.append([n1_id, n2['node_id'], 'material_spec_to_property_template'])\n",
    "                if (n2['node_id'], n3['node_id']) not in edge_set:\n",
    "                    edge_set.add((n2['node_id'], n3['node_id']))\n",
    "                    edges.append([n2['node_id'], n3['node_id'], 'property_template_to_categorical_bounds'])\n",
    "                if (n3['node_id'], n4_id) not in edge_set:\n",
    "                    edge_set.add((n3['node_id'], n4_id))\n",
    "                    edges.append([n3['node_id'], n4_id, 'categorical_bounds_to_ingredient_spec'])\n",
    "    add_nodes(nodes)\n",
    "    add_edges(edges)\n",
    "\n",
    "def add_ingredientSpec_to_processSpec1():\n",
    "    query = '''\n",
    "        MATCH (n1:ingredient_spec)-[r1]->(n2:ingredient_run)-[r2]->(n3:process_run)<-[r3]-(n4:process_spec)\n",
    "        RETURN n1.node_id as n1_id, n4.node_id as n4_id\n",
    "        '''\n",
    "    result = memgraph.execute_and_fetch(query)\n",
    "    nodes = []\n",
    "    node_set = set()\n",
    "    edges = []\n",
    "    edge_set = set()\n",
    "    for record in result:\n",
    "        n1_id = record['n1_id']\n",
    "        n4_id = record['n4_id']\n",
    "        original_n1_id = n1_id.split(',')[0]\n",
    "        original_n4_id = n4_id.split(',')[0]\n",
    "        query = '''\n",
    "                MATCH (n1:ingredient_spec)-[r1]->(n2)-[r2]->(n3:categorical_bounds)-\n",
    "                      [r3]->(n4:process_spec)\n",
    "                WHERE n1.node_id = \"{}\" AND n4.node_id = \"{}\"\n",
    "                RETURN apoc.convert.toJson(apoc.convert.toMap(n2)) AS n2, \n",
    "                       apoc.convert.toJson(apoc.convert.toMap(n3)) AS n3\n",
    "                '''.format(original_n1_id, original_n4_id)\n",
    "        res = graph.run(query)\n",
    "        for rec in res:\n",
    "            for i in range(len(rec)//2):\n",
    "                n2 = json.loads(rec[2*i])\n",
    "                n3 = json.loads(rec[2*i+1])\n",
    "                n2['node_id'] = n2['node_id'] + ',' + n1_id + ',' + n4_id\n",
    "                n3['node_id'] = n3['node_id'] + ',' + n1_id + ',' + n4_id\n",
    "                if n2['node_id'] not in node_set:\n",
    "                    node_set.add(n2['node_id'])\n",
    "                    nodes.append(n2)\n",
    "                if n3['node_id'] not in node_set:\n",
    "                    node_set.add(n3['node_id'])\n",
    "                    nodes.append(n3)\n",
    "                if (n1_id, n2['node_id']) not in edge_set:\n",
    "                    edge_set.add((n1_id, n2['node_id']))\n",
    "                    edges.append([n1_id, n2['node_id'], 'ingredient_spec_to_'+n2['type']])\n",
    "                if (n2['node_id'], n3['node_id']) not in edge_set:\n",
    "                    edge_set.add((n2['node_id'], n3['node_id']))\n",
    "                    edges.append([n2['node_id'], n3['node_id'], n2['type']+'_to_categorical_bounds'])\n",
    "                if (n3['node_id'], n4_id) not in edge_set:\n",
    "                    edge_set.add((n3['node_id'], n4_id))\n",
    "                    edges.append([n3['node_id'], n4_id, 'categorical_bounds_to_process_spec'])\n",
    "    add_nodes(nodes)\n",
    "    add_edges(edges)\n",
    "    \n",
    "def add_ingredientSpec_to_processSpec2():\n",
    "    query = '''\n",
    "        MATCH (n1:ingredient_spec)-[r1]->(n2:ingredient_run)-[r2]->(n3)-[r3]->(n4:categorical_bounds)-\n",
    "              [r4]->(n5:process_run)<-[r5]-(n6:process_spec)\n",
    "        RETURN n1.node_id as n1_id, n6.node_id as n6_id\n",
    "        '''\n",
    "    result = memgraph.execute_and_fetch(query)\n",
    "    nodes = []\n",
    "    node_set = set()\n",
    "    edges = []\n",
    "    edge_set = set()\n",
    "    for record in result:\n",
    "        n1_id = record['n1_id']\n",
    "        n6_id = record['n6_id']\n",
    "        original_n1_id = n1_id.split(',')[0]\n",
    "        original_n6_id = n6_id.split(',')[0]\n",
    "        query = '''\n",
    "                MATCH (n1:ingredient_spec)-[r1]->(n2)-[r2]->(n3:categorical_bounds)-\n",
    "                      [r3]->(n4:process_spec)\n",
    "                WHERE n1.node_id = \"{}\" AND n4.node_id = \"{}\"\n",
    "                RETURN apoc.convert.toJson(apoc.convert.toMap(n2)) AS n2, \n",
    "                       apoc.convert.toJson(apoc.convert.toMap(n3)) AS n3\n",
    "                '''.format(original_n1_id, original_n6_id)\n",
    "        res = graph.run(query)\n",
    "        for rec in res:\n",
    "            for i in range(len(rec)//2):\n",
    "                n2 = json.loads(rec[2*i])\n",
    "                n3 = json.loads(rec[2*i+1])\n",
    "                n2['node_id'] = n2['node_id'] + ',' + n1_id + ',' + n6_id\n",
    "                n3['node_id'] = n3['node_id'] + ',' + n1_id + ',' + n6_id\n",
    "                if n2['node_id'] not in node_set:\n",
    "                    node_set.add(n2['node_id'])\n",
    "                    nodes.append(n2)\n",
    "                if n3['node_id'] not in node_set:\n",
    "                    node_set.add(n3['node_id'])\n",
    "                    nodes.append(n3)\n",
    "                if (n1_id, n2['node_id']) not in edge_set:\n",
    "                    edge_set.add((n1_id, n2['node_id']))\n",
    "                    edges.append([n1_id, n2['node_id'], 'ingredient_spec_to_'+n2['type']])\n",
    "                if (n2['node_id'], n3['node_id']) not in edge_set:\n",
    "                    edge_set.add((n2['node_id'], n3['node_id']))\n",
    "                    edges.append([n2['node_id'], n3['node_id'], n2['type']+'_to_categorical_bounds'])\n",
    "                if (n3['node_id'], n6_id) not in edge_set:\n",
    "                    edge_set.add((n3['node_id'], n6_id))\n",
    "                    edges.append([n3['node_id'], n6_id, 'categorical_bounds_to_process_spec'])\n",
    "    add_nodes(nodes)\n",
    "    add_edges(edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "9894e7ae",
   "metadata": {},
   "source": [
    "## Without multiprocessing ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "78a74612",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "24.053618907928467\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "BFS()\n",
    "add_processSpec_to_materialSpec()\n",
    "add_materialSpec_to_ingredientSpec()\n",
    "add_ingredientSpec_to_processSpec1()\n",
    "add_ingredientSpec_to_processSpec2()\n",
    "end_time = time.time()\n",
    "print(end_time - start_time)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "a3359da0",
   "metadata": {},
   "source": [
    "## With multiprocessing ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 78,
   "id": "34cf5fd5",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "15.703113079071045\n"
     ]
    }
   ],
   "source": [
    "start_time = time.time()\n",
    "BFS()\n",
    "multiprocessing = [add_processSpec_to_materialSpec, add_materialSpec_to_ingredientSpec, \\\n",
    "                   add_ingredientSpec_to_processSpec1, add_ingredientSpec_to_processSpec2]\n",
    "with concurrent.futures.ThreadPoolExecutor() as executor:\n",
    "    futures = [executor.submit(func) for func in multiprocessing]\n",
    "concurrent.futures.wait(futures)\n",
    "end_time = time.time()\n",
    "print(end_time - start_time)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3830507a",
   "metadata": {},
   "source": [
    "## Experiments for Decoupling Algorithm ##"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "97f424a1",
   "metadata": {},
   "source": [
    "1. Template-spec ratio analysis: various ratio for each of material/process/measurement.\n",
    "2. Spec-run ratio analysis: various ratio for each of material/ingredient/process/measurement.\n",
    "3. Ingredient-condition/parameter_template ratio analysis: various ratio for ingredient_spec/ingredient_run\n",
    "4. Measurement-condition/parameter_template ratio analysis: various ratio for measurement_run\n",
    "4. material-property_template ratio analysis: various ratio for material_spec"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "168d1c25",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a9d6027b",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "df11fb62",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c05cdbc5",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "2be4ef42",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "e5b17ec8",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "17ba94bc",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "96250460",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "460c5acd",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "32c58f19",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "84bf2449",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "bb606177",
   "metadata": {},
   "source": [
    "# Merge & Match #"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "487fc8ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "def convert_jsonpath(path):\n",
    "    path = path.replace(']','')\n",
    "    path = re.split(r'&&|\\|\\||=', path)\n",
    "    currentPath = \"\"\n",
    "    query = []\n",
    "    i = 0\n",
    "    while i < len(path)-1:\n",
    "        if '[' in path[i]:\n",
    "            first,second = path[i].split(\"[\")\n",
    "            second = second.replace(\"'\",\"\")\n",
    "            second = second.replace(\" \", \"\")\n",
    "            query.append(second)\n",
    "        else:\n",
    "            s = path[i].replace(\"'\",\"\")\n",
    "            s = s.replace(\" \", \"\")\n",
    "            query.append(s)\n",
    "        s = path[i+1].replace(\"'\",\"\")\n",
    "        s = s.replace(\" \", \"\")\n",
    "        query.append(s)\n",
    "        i += 2\n",
    "    return query\n",
    "\n",
    "def generate_match_query(query, parent, child):\n",
    "    query = '''\n",
    "    MATCH path = (n) - [*..15] - > (m) \n",
    "    WHERE \n",
    "    '''\n",
    "    i = 0\n",
    "    while i < len(parent):\n",
    "        query += \"n.{} =~ '{}' AND \".format(parent[i].split('\\n')[0], parent[i+1].split('\\n')[0])\n",
    "        i += 2\n",
    "    i = 0\n",
    "    while i < len(child):\n",
    "        if i != len(child)-2:\n",
    "            query += \"m.{} =~ '{}' AND \".format(child[i].split('\\n')[0], child[i+1].split('\\n')[0])\n",
    "        else:\n",
    "            query += \"m.{} =~ '{}'\".format(child[i].split('\\n')[0], child[i+1].split('\\n')[0])\n",
    "        i += 2\n",
    "    query += '''\n",
    "    RETURN nodes(path) as nodes, relationships(path) as edges\n",
    "    '''\n",
    "    return query\n",
    "\n",
    "def generate_match_query_sub(query, start, end, child):\n",
    "    query = '''\n",
    "    MATCH path = (n1) - [*..15] - > (n2) - [*..15] -> (n3) \n",
    "    WHERE \n",
    "    '''\n",
    "    i = 0\n",
    "    while i < len(start):\n",
    "        query += \"n1.{} =~ '{}' AND \".format(start[i].split('\\n')[0], start[i+1].split('\\n')[0])\n",
    "        i += 2\n",
    "    i = 0\n",
    "    while i < len(child):\n",
    "        query += \"n2.{} =~ '{}' AND \".format(child[i].split('\\n')[0], child[i+1].split('\\n')[0])\n",
    "        i += 2\n",
    "    i = 0\n",
    "    while i < len(end):\n",
    "        if i != len(end)-2:\n",
    "            query += \"n3.{} =~ '{}' AND \".format(end[i].split('\\n')[0], end[i+1].split('\\n')[0])\n",
    "        else:\n",
    "            query += \"n3.{} =~ '{}'\".format(end[i].split('\\n')[0], end[i+1].split('\\n')[0])\n",
    "        i += 2\n",
    "    query += '''\n",
    "    RETURN nodes(path) as nodes, relationships(path) as edges\n",
    "    '''\n",
    "    return query\n",
    "\n",
    "def merge(result):\n",
    "    node_set = set()\n",
    "    nodes = []\n",
    "    edge_set = set()\n",
    "    edges = []\n",
    "    for record in result:\n",
    "        for node in record['nodes']:\n",
    "            n = node.properties\n",
    "            if n['node_id'] not in node_set:\n",
    "                node_set.add(n['node_id'])\n",
    "                nodes.append(n)\n",
    "        for edge in record['edges']:\n",
    "            if edge.id not in edge_set:\n",
    "                edge_set.add(edge.id)\n",
    "    for edge_id in edge_set:\n",
    "        query = '''\n",
    "                MATCH (n)-[r]->(m)\n",
    "                WHERE ID(r) = {}\n",
    "                RETURN n.node_id as nid, m.node_id as mid, type(r) as type\n",
    "                '''.format(edge_id)\n",
    "        result = memgraph.execute_and_fetch(query)\n",
    "        for record in result:\n",
    "            nid = record['nid']\n",
    "            mid = record['mid']\n",
    "            edge_type = record['type']\n",
    "            edges.append([nid, mid, edge_type])\n",
    "    memgraph.execute('MATCH (n) DETACH DELETE n')\n",
    "    add_nodes(nodes)\n",
    "    add_edges(edges)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f2f37298",
   "metadata": {},
   "source": [
    "Find proportion of time for merge and time for match\n",
    "Add binary version"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "27125cf7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def match(query_predicate):\n",
    "    # proportion of time for merge and time for match\n",
    "    predicate_list = query_predicate.split('FOLLOWS+')\n",
    "    start, end = predicate_list[-1], predicate_list[0]\n",
    "    query = generate_match_query(query_predicate, convert_jsonpath(start), convert_jsonpath(end))\n",
    "    result = memgraph.execute_and_fetch(query)\n",
    "    merge(result)\n",
    "    for i in range(1, len(predicate_list)-1):\n",
    "        cur = predicate_list[i]\n",
    "        query = generate_match_query_sub(query_predicate, convert_jsonpath(start), convert_jsonpath(end), convert_jsonpath(cur))\n",
    "        result = memgraph.execute_and_fetch(query)\n",
    "        merge(result)\n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "20996662",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_predicate = \"\"\"\n",
    "                  $..['type'='ingredient_run' && 'name' = '.*Selinium.*'] FOLLOWS+ \n",
    "                  ['type'='material_run' && 'tags'= '.*01_20.*'] FOLLOWS+ \n",
    "                  ['type' = 'process_run' && 'name'='.*Heating.*']\n",
    "                  \"\"\"\n",
    "match(query_predicate)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "55d98da8",
   "metadata": {},
   "source": [
    "# Unmerge #"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 963,
   "id": "5dc7b14b",
   "metadata": {},
   "outputs": [],
   "source": [
    "def unmerge():\n",
    "    nodes = []\n",
    "    edges = []\n",
    "    q = collections.deque()\n",
    "    visited = []\n",
    "    query = '''\n",
    "            MATCH (n)\n",
    "            WHERE NOT EXISTS(()-[]->(n))\n",
    "            RETURN properties(n) as n\n",
    "            '''\n",
    "    result = memgraph.execute_and_fetch(query)\n",
    "    for record in result:\n",
    "        n = record['n']\n",
    "        q.append(n['node_id'])\n",
    "        s1 = set()\n",
    "        s1.add(json.dumps(n))\n",
    "        nodes.append(s1)\n",
    "        s2 = set()\n",
    "        s2.add(n['node_id'])\n",
    "        visited.append(s2)\n",
    "        edges.append(set())\n",
    "    while q:\n",
    "        top = q.popleft()\n",
    "        query = '''\n",
    "                MATCH (n)-[r]->(m)\n",
    "                WHERE n.node_id = '{}'\n",
    "                RETURN properties(m) as m, ID(r) as edgeId\n",
    "                '''.format(top)\n",
    "        result = memgraph.execute_and_fetch(query)\n",
    "        for record in result:\n",
    "            m = record['m']\n",
    "            mid = m['node_id']\n",
    "            edgeId = record['edgeId']\n",
    "            index = -1\n",
    "            for i in range(len(visited)):\n",
    "                if top in visited[i]:\n",
    "                    index = i\n",
    "                    break\n",
    "            if mid not in visited[index]:\n",
    "                q.append(mid)\n",
    "                nodes[index].add(json.dumps(m))\n",
    "                visited[index].add(mid)\n",
    "            edges[index].add(edgeId)\n",
    "    return nodes, edges"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 964,
   "id": "e3824fa7",
   "metadata": {},
   "outputs": [],
   "source": [
    "nodes, edges = unmerge()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db0b1da8",
   "metadata": {},
   "source": [
    "# Deduplicate #"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "713132f6",
   "metadata": {},
   "outputs": [],
   "source": [
    "if value.type = nominal_real apply f1, else if value.type = uniform_real apply f2, else default, agg=sum, tau=0.1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "49d141d4",
   "metadata": {},
   "outputs": [],
   "source": [
    "def query_processing(query):\n",
    "    l = query.split(',')\n",
    "    tmps = []\n",
    "    conditions = []\n",
    "    for i in range(len(conditions)):\n",
    "        if i == 0:\n",
    "            tmp = conditions[i].split('if')\n",
    "        elif i == len(conditions)-1:\n",
    "            tmp = conditions[i].split('else')\n",
    "        else:\n",
    "            tmp = conditions[i].split('else if')\n",
    "        tmps.append(tmp)\n",
    "    for tmp in tmps:\n",
    "        first = tmp.split('=')[0]\n",
    "        second = tmp.split('=')[1].split('apply')[0]\n",
    "        third = tmp.split('=')[1].split('apply')[1]\n",
    "        conditions.append((first, second, third))\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "f95f85d7",
   "metadata": {},
   "outputs": [],
   "source": [
    "def dedup():\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "bfcac3a3",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "d23581c0",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "8618030b",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.10.9"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
